# Задача-2: 
# Напишите скрипт, отображающий папки текущей директории. 

import easy_lib as easy 
print(easy.DirListing()) 